Remove dash in name of node_name. in vars.tf 

harish@Azure:~/clouddrive/SRE/Azure/Terraform/aks1$ terraform apply
var.dns_prefix
  The DNS prefix associated to the managed cluster.

  Enter a value: exampleaks1

var.location
   The Azure location where the Managed Kubernetes Cluster will be provisioned.

  Enter a value: East US

var.log_analytics_workspace_id
  The ID of log analytics workspace for AKS self monitoring by Sentinel.

  Enter a value: testLogAnalyticsWorkspaceName1

var.name
  The name of the Managed Kubernetes Cluster.

  Enter a value: aks234

var.resource_group_name
  The name of the resource group in which this Managed Kubernetes Cluster will be provisioned.

  Enter a value: rg1234

var.vnet_subnet_id
  The subnet id inside vnet where aks cluster is to be deployed.

  Enter a value: aks-subnet


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.K8s will be created
  + resource "azurerm_kubernetes_cluster" "K8s" {
      + dns_prefix              = "exampleaks1"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = (known after apply)
      + location                = "eastus"
      + name                    = "aks234"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = true
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "rg1234"
      + sku_tier                = "Free"

      + addon_profile {

          + kube_dashboard {
              + enabled = true
            }

          + oms_agent {
              + enabled            = true
              + oms_agent_identity = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
        }

      + default_node_pool {
          + max_pods             = (known after apply)
          + name                 = "logstashdev"
          + node_count           = 3
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + vm_size              = "Standard_DS1_v2"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + client_app_id          = (known after apply)
              + managed                = (known after apply)
              + server_app_id          = (known after apply)
              + server_app_secret      = (sensitive value)
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
